<?php
$cities = ['Республика Адыгея'=> ['Майкоп'],
    'Республика Алтай'=>[
        'Барнаул','Бийск','Рубцовск'
    ],
    'Республика Башкортостан'=>[
        'Уфа','Стерлитамак','Салават','Нефтекамск','Октябрьский'
    ],
    'Республика Бурятия'=>[ 'Улан-Удэ' ],
    'Республика Дагестан'=>[
        'Махачкала','Хасавюрт','Дербент','Каспийск'
    ],
    'Республика Ингушетия'=>[ 'Назрань' ],
    'Кабардино-Балкарская Республика'=>[ 'Нальчик' ],
    'Республика Калмыкия'=>[ 'Элиста' ],
    'Карачаево-Черкесская Республика'=>[ 'Черкесск' ],
    'Республика Карелия'=>[ 'Петрозаводск' ],
    'Республика Коми'=>[ 'Сыктывкар' ],
    'Республика Крым'=>[ 'Симферополь','Керчь','Евпатория' ],
    'Республика Марий Эл'=>[ 'Йошкар-Ола' ],
    'Республика Мордовия'=>[ 'Саранск' ],
    'Республика Саха'=>[  ],
    'Республика Северная Осетия'=>[ 'Владикавказ' ],
    'Республика Татарстан'=>[ 'Казань','Набережные Челны','Нижнекамск','Альметьевск' ],
    'Республика Тыва'=>[ 'Кызыл' ],
    'Удмуртская Республика'=>[ 'Ижевск' ],
    'Республика Хакасия'=>[ 'Абакан' ],
    'Чеченская Республика'=>[ 'Грозный' ],
    'Чувашская Республика'=>[ 'Чебоксары','Новочебоксарск' ],
    'Алтайский край'=>[ 'Барнаул','Бийск','Рубцовск' ],
    'Забайкальский край'=>[ 'Чита' ],
    'Камчатский край'=>[ 'Петропавловск-Камчатский' ],
    'Краснодарский край'=>[ 'Краснодар','Сочи','Новороссийск','Армавир' ],
    'Красноярский край'=>[ 'Красноярск','Норильск','Ачинск' ],
    'Пермский край'=>[ 'Пермь','Березники' ],
    'Приморский край'=>[ 'Владивосток','Уссурийск','Находка','Артём' ],
    'Ставропольский край'=>[ 'Ставрополь','Пятигорск','Кисловодск','Невинномысск','Ессентуки' ],
    'Хабаровский край'=>[ 'Хабаровск','Комсомольск-на-Амуре' ],
    'Амурская область'=>[ 'Благовещенск' ],
    'Архангельская область'=>[ 'Архангельск','Северодвинск' ],
    'Астраханская область'=>[ 'Астрахань' ],
    'Белгородская область'=>[ 'Белгород','Старый Оскол' ],
    'Брянская область'=>[ 'Брянск' ],
    'Владимирская область'=>[ 'Владимир','Ковров','Муром' ],
    'Волгоградская область'=>[ 'Волгоград','Волжский','Камышин' ],
    'Вологодская область'=>[ 'Череповец','Вологда' ],
    'Воронежская область'=>[ 'Воронеж' ],
    'Ивановская область'=>[ 'Иваново' ],
    'Иркутская область'=>[ 'Иркутск','Братск','Ангарск' ],
    'Калининградская область'=>[ 'Калининград' ],
    'Калужская область'=>[ 'Калуга','Обнинск' ],
    'Кемеровская область'=>[ 'Новокузнецк','Кемерово','Прокопьевск' ],
    'Кировская область'=>[ 'Киров' ],
    'Костромская область'=>[ 'Кострома' ],
    'Курганская область'=>[ 'Курган' ],
    'Курская область'=>[ 'Курск' ],
    'Ленинградская область'=>[ 'Санкт-Петербург' ],
    'Липецкая область'=>[ 'Липецк','Елец' ],
    'Магаданская область'=>[ 'Магадан' ],
    'Московская область'=>[
        'Балашиха',' Химки',' Подольск',' Королёв',' Люберцы',' Мытищи',' Электросталь',' Коломна',' Одинцово',' Красногорск',' Серпухов',' Орехово-Зуево',' Щёлково',' Домодедово',' Жуковский',' Сергиев Посад',' Пушкино',' Раменское',' Ногинск',' Долгопрудный'
    ],
    'Мурманская область'=>[ 'Мурманск' ],
    'Нижегородская область'=>[ 'Нижний Новгород','Дзержинск','Арзамас' ],
    'Новгородская область'=>[ 'Великий Новгород' ],
    'Новосибирская область'=>[ 'Новосибирск','Бердск' ],
    'Омская область'=>[ 'Омск' ],
    'Оренбургская область'=>[ 'Оренбург','Орск' ],
    'Орловская область'=>[ 'Орёл' ],
    'Пензенская область'=>[ 'Пенза' ],
    'Псковская область'=>[ 'Псков' ],
    'Ростовская область'=>[ 'Ростов-на-Дону','Таганрог','Шахты','Новочеркасск','Волгодонск','Батайск','Новошахтинск' ],
    'Рязанская область'=>[ 'Рязань' ],
    'Самарская область'=>[ 'Самара','Тольятти','Сызрань','Новокуйбышевск' ],
    'Саратовская область'=>[ 'Саратов','Энгельс','Балаково' ],
    'Сахалинская область'=>[ 'Южно-Сахалинск' ],
    'Свердловская область'=>[ 'Екатеринбург','Нижний Тагил','Каменск-Уральский','Первоуральск' ],
    'Смоленская область'=>[ 'Смоленск' ],
    'Тамбовская область'=>[ 'Тамбов' ],
    'Тверская область'=>[ 'Тверь' ],
    'Томская область'=>[ 'Томск','Северск' ],
    'Тульская область'=>[ 'Тула','Новомосковск' ],
    'Тюменская область'=>[ 'Тюмень' ],
    'Ульяновская область'=>[ 'Ульяновск','Димитровград' ],
    'Челябинская область'=>[ 'Челябинск','Магнитогорск','Златоуст','Миасс','Копейск' ],
    'Ярославская область'=>[ 'Ярославль','Рыбинск' ],
    'Москва'=>[ 'Москва' ],
    'Санкт-Петербург'=>[ 'Санкт-Петербург' ],
    'Севастополь'=>[ 'Севастополь' ],
    'Еврейская автономная область'=>[  ],
    'Ненецкий автономный округ'=>[  ],
    'Ханты-Мансийский автономный округ'=>[ 'Сургут','Нижневартовск','Нефтеюганск' ],
    'Чукотский автономный округ'=>[  ],
    'Ямало-Ненецкий автономный округ'=> [ 'Новый Уренгой','Ноябрьск' ]];

$regions = explode("\n", $regions);
sort($regions);
//$db->setQuery("TRUNCATE #__mycityselector_region"); // remove regions
//$db->execute();
foreach ($regions as $region) {
    out("  {$region}\n", 'light_blue');
    $name = $db->escape($region);
    $db->setQuery("INSERT INTO #__mycityselector_region (`country_id`, `name`, `subdomain`) VALUES (1, '{$name}', '')");
    $db->execute();
}
out(" Generate slugs\n", 'green');
include dirname(__FILE__) . '/slug1.php';

